#include "Header.h"

char* calculateOpz(opz_list_el* opzList_head)
{
	char* result = '0';
	number_stack_el* numberStack_head = NULL;

	//взять 1-й эл-т (взять - перевести в 10сс и иметь переменную на нём)
	//NULL -> печать сообщения об ошибке и выход
	//выделить память для результата размером эл-та (malloc)
	//перейти на 2-й эл-т
	//если символ - ошибка

	//пока не дошли до конца списка
	//число - перевести в 10сс и кинуть в стек чисел
	//знак - взять 2 эл-та со стека чисел и провести действие
	//расширить память результата в завис-ти от порядков чисел, с которыми проводится действие, записать результат туда 

	//вернуть результат
}